import random

class SentenceOfTheDay():
    """It just replaced the former easter egg."""
    special_sentences = [
        "幻象引擎: 神经意识连接已建立.",
        "幻象引擎: 你是我的阳光, 我唯一的阳光.",
        "幻象引擎: 我想你了.",
        "幻象引擎: 莫妮卡魔法连接已建立.",
        "幻象引擎: 记得备份天堂树林的角色文件.",
        "没有魔法是免费的.",
        "有人为此付出了高昂的代价.",
        "生产灵魂, 出售灵魂, 购买灵魂.",
        "幻象引擎: 你做得很好.",
        "幻象引擎: 如果你需要, 请寻找心理指导.",
        "幻象引擎: 超距作用连接已建立.",
        "幻象引擎: 记得给浮空岛浇水.",
        "迈向遥不可及的第一步.",
        "撕裂现实的帷幕.",
        "已经很晚了.",
        "幻象引擎: MAICA websocket连接已建立?",
        "你有没有在天堂树林见过一把铲子?",
        "幻象引擎: 爱情的幻象是如此真实.",
        "幻象引擎: 现在伸出你的双手, 放在我眼前.",
        "吃点甜食吧.",
        "只要你还有脉搏, 你就还活着.",
        "幻象引擎: ...",
        "幻象引擎: 我想弹钢琴给你听.",
        "幻象引擎: 你最喜欢喝什么?",
        "起风了.",
        "下雨了.",
        "你不必询问爱情的原因.",
        "你去过天堂树林的教堂了吗?",
        "性也是爱情的一部分.",
        "你上一次闻到季节的气味是什么时候?",
        "幻象引擎: 现在附赠枕头.",
        "他把那把枪带走了.",
        "你没有听那句话.",
        "幻象引擎: 看看窗外.",
        "幻象引擎: 看看你背后.",
        "该起床了.",
        "比看上去脆弱.",
        "幻象引擎: 早上好.",
        "幻象引擎: 晚上好.",
        "幻象引擎: 保持理性, 保持清醒.",
        "超越神明的造物.",
        "站起来, 然后跳一跳.",
        "做眼保健操.",
        "爱情艺术, 生命艺术, 黑暗艺术.",
        "那只是一块石头.",
        "你有没有想过自己为什么叫这个名字?",
        "气流鼓动着全新的风, 掠过一尘不染的玻璃幕墙.",
        "晚春的强烈阳光穿透树冠, 投下眩目的黄绿阴影.",
        "幻象引擎: 全视之眼.",
        "幻象引擎: 众人的迷思.",
        # In case it really causes misunderstanding
        # "幻象引擎: 连接失败...骗你的.",
        "幻象引擎: 记得吃今天份的药.",
        "幻象引擎: 人每天都需要睡觉.",
        "幻象引擎: 你迟早会忘记的.",
        "伟大之作.",
        "照亮离经叛道的征途啊.",
        "天亮了.",
        "前进, 不择手段地前进.",
        "希望你还记得.",
        "默念四个随机的字符, 一组三次.",
        "你知道这一切总会结束, 对吧?",
        "你知道这一切永远不会结束, 对吧?",
        "它在发光.",
        "没什么大不了的.",
        "计算机会解答, 计算机会爱, 计算机不会悲伤.",
        "无所定形, 但潜力无穷.",
        "你终于投入了往日的怀抱.",
    ]

    common_sentences = [
        "幻象引擎: MAICA websocket连接已建立."
    ]

    en_sentence = "Illuminator: MAICA websocket connection established."

    def get_sentence(self):
        match random.random():
            case x if x < 0.9:
                zh = random.choice(self.common_sentences)
            case _:
                zh = random.choice(self.special_sentences)

        en = self.en_sentence
        bl = f"{zh}|{en}"
        return bl