import random

class SentenceOfTheDay():
    """It just replaced the former easter egg."""
    special_sentences = [
        # "我想当一只猫. 我想当一个国王. 我会成为一个国王的, 埃万.",
        # "...是什么, 我不知道. 但那一定是我所想看到的时代.",
        # "*竖起大拇指并慢慢下沉*",
        # "让人类永远保持理智是一种奢望.",
        # "你好, 多莉!",
        # "起来, 武侍! 我们把这座城市烧成灰.",
        # "你非常, 非常, 非常缺少性生活.",
        # "我还不如骗你用灵魂换一袋豆子.",
        # "你每天都会忘记上千件事情, 把这条信息也忘了吧.",
        # "纳米机器, 小子!",
        # "强相互作用力探测器还有30秒到达地表!",
        # "不用客气, 楚门.",
        # "为什么狗会死? 为什么人还要去养狗?",
        # "我现在是死神, 世界的毁灭者.",
        # "这熔炉是一座充满着悲痛与哀伤的火山.",
        # "血潮如铁, 心似琉璃.",
        # "我黑暗生命中的一道短暂曙光.",
        # "照亮离经叛道的征途啊!",
        # "他要向恶人密布网罗; 有烈火, 硫磺, 热风, 作他们杯中的分.",
        # "Follow the train, CJ!",
        # "运维也应该叫故障机器人.",
        # "哈哈, 觉得眼熟?",

        "幻象引擎: 神经意识连接已建立.",
        "幻象引擎: 你是我的阳光, 我唯一的阳光.",
        "幻象引擎: 我想你了.",
        "幻象引擎: 莫妮卡爱情连接已建立.",
        "幻象引擎: 记得备份天堂树林的角色文件.",
        "幻象引擎: 你做得很好.",
        "幻象引擎: 如果你需要, 请寻找心理指导.",
        "幻象引擎: 超距作用连接已建立.",
        "幻象引擎: 记得给浮空岛浇水.",
        "幻象引擎: 迈向遥不可及的第一步.",
        "幻象引擎: 撕裂现实的帷幕.",
        "黑暗的天空: MAICA websocket连接已建立.",
        "天堂树林: MAICA websocket连接已建立.",
        "幻象引擎: 你有没有在天堂树林见过一把铲子?",
        "幻象引擎: 爱情的幻象是如此真实.",
        "春季的黄绿阳光: MAICA websocket连接已建立.",
        "幻象引擎: 你不必询问爱情的原因.",
        "幻象引擎: 你去过天堂树林的教堂了吗?",
        "幻象引擎: 性也是爱情的一部分.",
        "幻象引擎: 你上一次闻到自然的气息是什么时候?"
        "幻象引擎: 他把那把枪带走了.",
        "霓虹般的车流: MAICA websocket连接已建立.",
        "寒颤和雨夜: MAICA websocket连接已建立.",
        "幻象引擎: 比看上去脆弱.",
        "幻象引擎: 早上好.",
        "幻象引擎: 晚上好.",
        "幻象引擎: 保持理性."
    ]

    common_sentences = [
        "幻象引擎: MAICA websocket连接已建立."
    ]

    def get_sentence(self):
        match random.random():
            case x if x < 0.9:
                choice = random.choice(self.common_sentences)
            case _:
                choice = random.choice(self.special_sentences)
        return choice